In [3]:
a =  'Swara'
print(type(a))

<class 'str'>

In [4]:
num  =  34
print(type(num))

<class 'int'>

In [5]:
num2  = 34.87
print(type(num2))

<class 'float'>

In [6]:
b  =  True
print(type(b))

<class 'bool'>

In [7]:
l =  [12,87,45,6]
print(type(l))

<class 'list'>

In [8]:
t =  (12,87,45,6 ,  True  , 'Python')
print(type(t))

<class 'tuple'>

In [9]:
s =  {23 ,45,7,67}
print(type(s))

<class 'set'>

In [10]:
info  = {"Name" : ['Prajakta' ,  'sarthak' ,  'Adarsh'] ,  
"Age"  : [23  , 24  , 10]}

In [11]:
print(type(info))

<class 'dict'>

In [12]:
import  pandas as pd

In [13]:
df  =  pd.DataFrame(info)

In [14]:
df

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [15]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

##### Attributes
- Shape
- Columns
- Index
- Size
- Dtype
- Values

In [16]:
df.shape

(3, 2)

In [17]:
df.size

6

In [18]:
df.dtypes

Name    object
Age      int64
dtype: object

In [19]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [20]:
df.values

array([['Prajakta', 23],
       ['sarthak', 24],
       ['Adarsh', 10]], dtype=object)

In [21]:
df.index

RangeIndex(start=0, stop=3, step=1)

### Methods / functions
- info()
- head()
- tail()
- sum()
- sort_values()

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [23]:
df.head(  )

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [24]:
df.tail(1)

     Name  Age
2  Adarsh   10

In [25]:
def add(x,  y  = 34):
    return  x+y

In [26]:
add(23,  55)

78

In [27]:
add(2)

36

In [28]:
df.sort_index()

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [29]:
df['Name'].value_counts()

Name
Prajakta    1
sarthak     1
Adarsh      1
Name: count, dtype: int64

In [30]:
len(t)

6

### Create class Person

In [31]:
class Person:
    def __init__(self  , Name  , Age  , Gender  , Occupation):
        self.name =   Name
        self.age  =  Age
        self.gender  =  Gender
        self.occupation  =  Occupation

In [32]:
# name  =  ' Sunita' ,  age  - 25 ,  gender  = female  ,  occupation =  'DA'
o1  =  Person(Name  =  ' Sunita' ,  Age  = 25 ,  Gender  = 'female'  ,  Occupation =  'DA')

In [33]:
o1

In [34]:
o1.name

' Sunita'

In [35]:
o1.age

25

In [36]:
o1.gender

'female'

In [37]:
o1.occupation

'DA'

In [38]:
o2  =  Person(Name = 'Suresh' ,   Age  =  26  , Gender  ='Male' ,  Occupation= "DS")

In [39]:
o2

In [40]:
o2.name

'Suresh'

In [41]:
o2.name

'Suresh'

In [42]:
o2.age

26

In [43]:
o2.gender

'Male'

In [44]:
o2.occupation

'DS'

## Add education attribute o2

In [45]:
o2.Education = "MBA"

In [46]:
o2.Education

'MBA'

In [47]:
o2.name

'Suresh'

In [48]:
o2.name  = 'Nitikesh'

In [49]:
o2.name

'Nitikesh'

## delete attributes

In [50]:
o2.__delattr__('Education')

## Education is deleted

In [51]:
o2.Education

AttributeError: 'Person' object has no attribute 'Education'

In [ ]:
class Person:
    def __init__(self  , Name  , Age  , Gender  , Occupation):
        self.name =   Name
        self.age  =  Age
        self.gender  =  Gender
        self.occupation  =  Occupation

        # add method talk
    def talk(self):
        print(f'Hi there My name  is {self.name}')
        print(f'I am  {self.age}  years  old')
        print(f' i am  {self.gender}')
        print(f'i Work as {self.occupation}')

In [ ]:
o3  =  Person(Name  =   'Umesh' , Age  = 29 , Gender = 'Male' , Occupation  = 'Bussiness')

In [ ]:
o3

In [ ]:
print(o3.name)
print(o3.age)
print(o3.occupation)
print(o3.gender)

Umesh
29
Bussiness
Male

In [ ]:
o3.talk()

Hi there My name  is Umesh
I am  29  years  old
 i am  Male
i Work as Bussiness

In [ ]:
o4  =  Person(Name  =   'Umesh' , Age  = 29  , Occupation  = 'Bussiness')

TypeError: Person.__init__() missing 1 required positional argument: 'Gender'

## Class Attributes
- Create class employee

In [53]:
class Employee:
    Company  = "TCS"
    def __init__(self , name , id):
        self.name   = name
        self.id  =  id

In [54]:
e1  =  Employee(name  = 'Raman' , id  = 'emp0001')

In [55]:
e1

In [56]:
e2 =  Employee(name  = 'john' , id  ='Emp0002')

In [58]:
e1.name
e2.name

'john'

In [59]:
e1.Company

'TCS'

In [60]:
e2.Company

'TCS'

In [61]:
e1.Company = "Infosys"

In [62]:
e1.Company

'Infosys'

## dataclass method

In [65]:
from dataclasses import dataclass
from  typing import Union , List , Literal

## create class studdent
- Name
- Marks
- Age 
- gender
- Hobby

In [66]:
@dataclass
class Student: 
    Name : str
    Marks : int|float
    Age  : int
    Gender : Literal["Male" , "Female"]
    Hobbies : List[str]

In [67]:
s1  =  Student(Name  = 'Amar' ,  Marks  = 78 ,  Age =  27   , Gender = 'Male' , Hobbies = 'Reading'  )

In [68]:
s1

Student(Name='Amar', Marks=78, Age=27, Gender='Male', Hobbies='Reading')

In [69]:
s1.Name

'Amar'

In [70]:
s1.info()

AttributeError: 'Student' object has no attribute 'info'

In [71]:
s2 =  Student(Name  = 'Amar' ,  Marks  = 78 ,  Age =  27   , Gender = 'Male' , Hobbies = ['Reading' , 'Swimming' ])

In [72]:
s2.Hobbies

['Reading', 'Swimming']

In [73]:
s3 = Student(Name = 123 , Marks = 76 , Age = 8 , Gender = 'Male' , Hobbies = ('playing'))

In [75]:
s3.Name

123

In [76]:
s3.Hobbies

'playing'